app/controllers/chapters_controller.rb

SELECT * FROM "chapters" WHERE ("chapters"."id" = 1)
---
  def show
    @chapter = Chapter.find(params[:id])

SELECT * FROM "chapters" WHERE ("chapters"."id" = 1)
---
  def edit
    @chapter = Chapter.find(params[:id])

INSERT INTO "chapters" ("updated_at", "title", "body", "teaser", "position", "created_at") VALUES('2009-05-11 18:41:00', 'Blocks', 'body of chapter', 'this is the teaser', NULL, '2009-05-11 18:41:00')
---
  def create
    @chapter = Chapter.new(params[:chapter])

    respond_to do |format|
      if @chapter.save

SELECT * FROM "chapters" WHERE ("chapters"."id" = 1)
UPDATE "chapters" SET "version" = 1, "teaser" = 'making sure to update the teaser', "title" = 'Second Chapter follow up', "body" = 'we haqve a new body', "updated_at" = '2009-05-11 22:25:26' WHERE "id" = 2
---
  def update
    @chapter = Chapter.find(params[:id])

    respond_to do |format|
      if @chapter.update_attributes(params[:chapter])