app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])
    @comment.chapter_id = params[:chapter_id]
    if @comment.save
---
INSERT INTO "comments" ("name", "updated_at", "body", "chapter_id", "blog_url", "email", "created_at") VALUES('paul', '2009-05-12 00:12:38', 'how are you', 1, NULL, 'paul@miamiphp.org', '2009-05-12 00:12:38')