app/controllers/revisions_controller.rb

  def show
    @chapter = Chapter.find params[:chapter_id]
---
SELECT * FROM "chapters" WHERE ("chapters"."id" = 1)